Tekla Open API Reference for Tekla Structures 2025
ProfileItem.ProfileItemSubType Property
 The profile item subtype.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ProfileItem.ProfileItemSubTypeEnum ProfileItemSubType { get; set; }
Public Property ProfileItemSubType As ProfileItem.ProfileItemSubTypeEnum
	Get
	Set
Property Value
Type: ProfileItem.ProfileItemSubTypeEnum
See Also
Reference
ProfileItem Class
Tekla.Structures.Catalogs Namespace